
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МаршрутОтображение();
КонецПроцедуры

&НаСервере
Процедура МаршрутОтображение()
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Доставка Тогда
		Элементы.Маршрут.Видимость = ИСТИНА	 
	Иначе  
		Объект.Маршрут = Неопределено; 
		Элементы.Маршрут.Видимость = ЛОЖЬ;      
	КонецЕсли; 	     
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	МаршрутОтображение();
КонецПроцедуры     

&НаКлиенте
Процедура СоставЗаказаКоличествоЦенаСтоимостьПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоимость = СтрокаТабличнойЧасти.ЦенаЗаЕд * СтрокаТабличнойЧасти.Количество;
	ОбщаяСтоимостьРасчет();
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)    
	Клиент = Объект.Клиент;
	Форма = ПолучитьФорму("Справочник.ФайлыКлиентов.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = Клиент;
	Форма.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.ИсторияВзаимодействий.СоздатьНаборЗаписей(); 
	История.Прочитать();
	ЗаписьИстории = История.Добавить();
	ЗаписьИстории.Клиент = Объект.Клиент;
	ЗаписьИстории.ТипВзаимодействия = Перечисления.ТипыВзаимодействий.ОформлениеЗаказа; 
	ЗаписьИстории.Период = Объект.Дата;
	История.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаИтогСтоимостьПриИзменении(Элемент)
	ОбщаяСтоимостьРасчет();
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяСтоимостьРасчет()
	Объект.ОбщаяСтоимость = Объект.СоставЗаказа.Итог("Стоимость");
КонецПроцедуры
