
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Договора.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договора.Дата,
	|	Договора.Клиент,
	|	Договора.Менеджер,
	|	Договора.Номер,
	|	Договора.СрокДействияПо,
	|	Договора.СрокДействияС,
	|	Договора.УсловияОплаты,
	|	Договора.ШтрафыЗаНарушениеУсловий,
	|	Договора.ПоставляемаяПродукция.(
	|		НомерСтроки,
	|		Продукция
	|	)
	|ИЗ
	|	Документ.Договора КАК Договора
	|ГДЕ
	|	Договора.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПоставляемаяПродукцияШапка = Макет.ПолучитьОбласть("ПоставляемаяПродукцияШапка");
	ОбластьПоставляемаяПродукция = Макет.ПолучитьОбласть("ПоставляемаяПродукция");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПоставляемаяПродукцияШапка);
		ВыборкаПоставляемаяПродукция = Выборка.ПоставляемаяПродукция.Выбрать();
		Пока ВыборкаПоставляемаяПродукция.Следующий() Цикл
			ОбластьПоставляемаяПродукция.Параметры.Заполнить(ВыборкаПоставляемаяПродукция);
			ТабДок.Вывести(ОбластьПоставляемаяПродукция, ВыборкаПоставляемаяПродукция.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
