
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Заказы.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказы.Дата,
	|	Заказы.Клиент,
	|	Заказы.Номер,
	|	Заказы.ОбщаяСтоимость,
	|	Заказы.ОтветственныйМенеджер,
	|	Заказы.СпособДоставки,
	|	Заказы.СрокВыполнения,
	|	Заказы.СтатусЗаказа,
	|	Заказы.СоставЗаказа.(
	|		НомерСтроки,
	|		Продукция,
	|		ТипУпаковки,
	|		Объем,
	|		Количество,
	|		ЦенаЗаЕд,
	|		Стоимость
	|	)
	|ИЗ
	|	Документ.Заказы КАК Заказы
	|ГДЕ
	|	Заказы.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСоставЗаказаШапка = Макет.ПолучитьОбласть("СоставЗаказаШапка");
	ОбластьСоставЗаказа = Макет.ПолучитьОбласть("СоставЗаказа");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСоставЗаказаШапка);
		ВыборкаСоставЗаказа = Выборка.СоставЗаказа.Выбрать();
		Пока ВыборкаСоставЗаказа.Следующий() Цикл
			ОбластьСоставЗаказа.Параметры.Заполнить(ВыборкаСоставЗаказа);
			ТабДок.Вывести(ОбластьСоставЗаказа, ВыборкаСоставЗаказа.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
