&НаКлиенте
Процедура Файлы(Команда)    
	Клиент = Объект.Клиент;
	Форма = ПолучитьФорму("Справочник.ФайлыКлиентов.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = Клиент;
	Форма.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.ИсторияВзаимодействий.СоздатьНаборЗаписей(); 
	История.Прочитать();
	ЗаписьИстории = История.Добавить();
	ЗаписьИстории.Клиент = Объект.Клиент;
	ЗаписьИстории.ТипВзаимодействия = Перечисления.ТипыВзаимодействий.ОформлениеДоговора; 
	ЗаписьИстории.Период = Объект.Дата;
	История.Записать();
КонецПроцедуры
