&НаКлиенте
Процедура Файлы(Команда)    
	Клиент = Объект.Клиент;
	Форма = ПолучитьФорму("Справочник.ФайлыКлиентов.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = Клиент;
	Форма.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.ИсторияВзаимодействий.СоздатьНаборЗаписей(); 
	История.Прочитать();
	ЗаписьИстории = История.Добавить();
	ЗаписьИстории.ТипВзаимодействия = Перечисления.ТипыВзаимодействий.ПодписаниеСоглашения; 
	ЗаписьИстории.Клиент = Объект.Клиент;
	ЗаписьИстории.Период = Объект.Дата;
	История.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)     
	Договор = Объект.Договор;
	Объект.Клиент = ПолучитьИнформацию(Договор) 
КонецПроцедуры      

Функция ПолучитьИнформацию(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договора.Клиент КАК Клиент
	|ИЗ
	|	Документ.Договора КАК Договора
	|ГДЕ
	|	Договора.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Клиент;
	КонецЦикла;

КонецФункции  

